app/Models/User.php

SELECT `u`.*, CONCAT(Last_Name, ', ', First_Name) AS fname, `ul`.`ID` AS `user_login_ID`, `ul`.`Username`, `ul`.`Password`
FROM `user` `u`
LEFT JOIN `user_login` `ul` ON u.`User_ID` = ul.User_ID
WHERE `ul`.`User_ID` = '1'
---
    public function getUserDetails($userID) {
        $sql = $this->db->table('user u')
                    ->select("u.*,
                            CONCAT(Last_Name, ', ', First_Name) AS fname,
                            ul.ID AS user_login_ID,
                            ul.Username,
                            ul.Password")
                    ->join('user_login ul', 'u.`User_ID` = ul.User_ID', 'left')
                    ->where('ul.User_ID', $userID)
                    ->get();